smileAs/discovery_tc27x/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC27X_DC_PB_DEMOCD_V500_REL322/TC27x_DCstep/Aurix_MC-ISAR/iom_infineon_tricore/ssc/inc/Iom.h
/******************************************************************************
**                                                                           **
** Copyright (C) Infineon Technologies (2013)                                **
**                                                                           **
** All rights reserved.                                                      **
**                                                                           **
** This document contains proprietary information belonging to Infineon      **
** Technologies. Passing on and copying of this document, and communication  **
** of its contents is not permitted without prior written authorization.     **
**                                                                           **
*******************************************************************************
**                                                                           **
**  $FILENAME   : Iom.h $                                                    **
**                                                                           **
**  $CC VERSION : \main\34 $                                                 **
**                                                                           **
**  $DATE       : 2016-06-27 $                                               **
**                                                                           **
**  AUTHOR      : DL-AUTOSAR-Engineering                                     **
**                                                                           **
**  VENDOR      : Infineon Technologies                                      **
**                                                                           **
**  DESCRIPTION : This header file exports functionalities of IOM driver     **
**                                                                           **
**  MAY BE CHANGED BY USER [yes/no]: No                                      **
**                                                                           **
******************************************************************************/
/*  TRACEABILITY: [cover parentID= DS_NAS_IOM_PR1743,DS_NAS_IOM_PR1751_0,    **
**               DS_NAS_IOM_PR1751_1,DS_NAS_IOM_PR1747_1,DS_NAS_IOM_PR1747   **
**               DS_NAS_IOM_PR1745,DS_NAS_IOM_PR1745_1,DS_NAS_IOM_PR1746_1,  **
**               DS_NAS_IOM_PR1746,DS_NAS_IOM_PR1752,DS_NAS_IOM_PR1753_1,    **
**               DS_NAS_IOM_PR1753,DS_NAS_IOM_PR1748,DS_NAS_IOM_PR1749,      **
**               DS_NAS_IOM_PR1759_1,DS_NAS_IOM_PR1759_2]
[/cover]
*/


#ifndef  IOM_H
#define  IOM_H

/*******************************************************************************
**                      Include Section                                       **
*******************************************************************************/

/* Inclusion of Platform_Types.h and Compiler.h */
#include "Std_Types.h"

/* Iom Pre-compile/static configuration file */
#include "Iom_Cfg.h"

/* Include Iom definitions  */
#include "IfxIom_reg.h"

/* Global functions like Set/Reset END INIT protection bit,
  Enable/Disable interrupts, Automic write function */
#include "Mcal.h"
#include "Mcal_DmaLib.h"

/* Conditional Inclusion of Developement Error Tracer File */
#if (IOM_DEV_ERROR_DETECT == STD_ON)

#include "Det.h"

#endif /* (IOM_DEV_ERROR_DETECT == STD_ON) */

#if ((IOM_USER_MODE_INIT_API_ENABLE == STD_ON) || \
     (IOM_USER_MODE_RUNTIME_API_ENABLE == STD_ON) || \
     (IOM_USER_MODE_DEINIT_API_ENABLE == STD_ON) ||\
     (IOM_RUNNING_IN_USER_0_MODE_ENABLE == STD_ON))
           #include "Iom_Protect.h"
#endif
/*******************************************************************************
**                      Global Macro Definitions                              **
*******************************************************************************/
/*
  Macros used in protected mode support.
*/
#define IOM_CLC_DISS                0x00000002U
#define IOM_CLC_DISR                0xFFFFFFFEU
#define IOM_KRST0_RSTSTAT           0x00000002U
#define IOM_FPCCTR_CMP              0xFFFF0000U
#define IOM_FPCCTR_CMP_SETMASK      0x0000FFFFU
#define IOM_CLC_DISS_BITPOS         1U
#define IOM_KRST0_RSTSTAT_BITPOS    1U
#define IOM_INIT_ACCESS             1U
#define IOM_DEINIT_ACCESS           2U
#define IOM_RUNTIME_ACCESS          3U



#if (IOM_USER_MODE_INIT_API_ENABLE == STD_ON)
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
  /*IFX_MISRA_RULE_19_04_STATUS=First level of indirection is used to support
modification of OS protected calls, so it cannot be expand to a braced
 initialiser*/
#define IOM_SFR_INIT_RESETENDINIT()           IOM_INIT_RESETENDINIT()
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
/*IFX_MISRA_RULE_19_04_STATUS=First level of indirection is used to support
modification of OS protected calls, so it cannot be expand to a braced
 initialiser*/
#define IOM_SFR_INIT_SETENDINIT()             IOM_INIT_SETENDINIT()
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
 /*IFX_MISRA_RULE_19_04_STATUS=First level of indirection is used to support
modification of OS protected calls, so it cannot be expand to a braced
 initialiser*/
#define IOM_SFR_INIT_WRITE32(reg,value)      IOM_INIT_WRITE32((reg),(value))
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
  /*IFX_MISRA_RULE_19_04_STATUS=First level of indirection is used to support
modification of OS protected calls, so it cannot be expand to a braced
 initialiser*/
#define IOM_SFR_INIT_MODIFY32(reg,clearmask,setmask)     \
                                  IOM_INIT_MODIFY32((reg),(clearmask),(setmask))
  /*IFX_MISRA_RULE_19_04_STATUS=First level of indirection is used to support
modification of OS protected calls, so it cannot be expand to a braced
 initialiser*/
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define IOM_SFR_INIT_RESETSAFETYENDINIT_TIMED(Time)  \
                                        IOM_INIT_RESETSAFETYENDINIT_TIMED(Time)
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
/*IFX_MISRA_RULE_19_04_STATUS=First level of indirection is used to support
modification of OS protected calls, so it cannot be expand to a braced
 initialiser*/
#define IOM_SFR_INIT_SETSAFETYENDINIT_TIMED()  IOM_INIT_SETSAFETYENDINIT_TIMED()
#if (IOM_RUNNING_IN_USER_0_MODE_ENABLE == STD_ON)
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
/*IFX_MISRA_RULE_19_04_STATUS=First level of indirection is used to support
modification of OS protected calls, so it cannot be expand to a braced
 initialiser*/
  #define IOM_SFR_INIT_USER_MODE_WRITE32(reg, value)        \
                              IOM_INIT_USER_MODE_OS_API_WRITE32((reg),(value))
   /*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
    /*IFX_MISRA_RULE_19_04_STATUS=First level of indirection is used to support
  modification of OS protected calls, so it cannot be expand to a braced
  initialiser*/
  #define IOM_SFR_INIT_USER_MODE_READ32(reg)                 \
                                          IOM_INIT_USER_MODE_OS_API_READ32(reg)
  /*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
  /*IFX_MISRA_RULE_19_04_STATUS=First level of indirection is used to support
  modification of OS protected calls, so it cannot be expand to a braced
  initialiser*/
  #define IOM_SFR_INIT_USER_MODE_MODIFY32(reg,clearmask,setmask) \
                 IOM_INIT_USER_MODE_OS_API_MODIFY32((reg),(clearmask),(setmask))
  #else
   /*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
  /*IFX_MISRA_RULE_19_04_STATUS=First level of indirection is used to support
  modification of OS protected calls, so it cannot be expand to a braced
  initialiser*/
  #define IOM_SFR_INIT_USER_MODE_WRITE32(reg,value)    ((reg) = (value))
  /*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
  #define IOM_SFR_INIT_USER_MODE_READ32(reg)                   (reg)
    /*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
    /*IFX_MISRA_RULE_19_04_STATUS=First level of indirection is used to support
modification of OS protected calls, so it cannot be expand to a braced
 initialiser*/
  #define IOM_SFR_INIT_USER_MODE_MODIFY32(reg,clearmask,setmask) \
     { uint32 val ; val = (reg) ; val &= (clearmask); val |= (setmask); \
                                                                   (reg) = val;}
#endif /* IOM_RUNNING_IN_USER_0_MODE_ENABLE == STD_ON  */
#else
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define IOM_SFR_INIT_RESETENDINIT()                   (Mcal_ResetENDINIT())
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
  /*IFX_MISRA_RULE_19_04_STATUS=First level of indirection is used to support
modification of OS protected calls, so it cannot be expand to a braced
 initialiser*/
#define IOM_SFR_INIT_WRITE32(reg, value)              ((reg) = (value))
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
 /*IFX_MISRA_RULE_19_04_STATUS=First level of indirection is used to support
modification of OS protected calls, so it cannot be expand to a braced
 initialiser*/
#define IOM_SFR_INIT_MODIFY32(reg, clearmask,setmask) \
  {uint32 val ; val = (reg) ; val &= (clearmask); val |= (setmask);(reg) = val;}
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define IOM_SFR_INIT_SETENDINIT()                      (Mcal_SetENDINIT())
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define IOM_SFR_INIT_RESETSAFETYENDINIT_TIMED(Time)       \
                                           (Mcal_ResetSafetyENDINIT_Timed(Time))
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define IOM_SFR_INIT_SETSAFETYENDINIT_TIMED()    (Mcal_SetSafetyENDINIT_Timed())
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define IOM_SFR_INIT_USER_MODE_WRITE32(reg, value)     ((reg) = (value))
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define IOM_SFR_INIT_USER_MODE_READ32(reg)             (reg)
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
   /*IFX_MISRA_RULE_19_04_STATUS=First level of indirection is used to support
modification of OS protected calls, so it cannot be expand to a braced
 initialiser*/
#define IOM_SFR_INIT_USER_MODE_MODIFY32(reg,clearmask,setmask)  \
  {uint32 val ; val = (reg) ; val &= (clearmask); val |= (setmask);(reg) = val;}
#endif /* IOM_USER_MODE_INIT_API_ENABLE == STD_ON  */

#if (IOM_USER_MODE_RUNTIME_API_ENABLE == STD_ON)
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
/*IFX_MISRA_RULE_19_04_STATUS=First level of indirection is used to support
modification of OS protected calls, so it cannot be expand to a braced
initialiser*/
#define IOM_SFR_RUNTIME_RESETENDINIT()         IOM_RUNTIME_RESETENDINIT()
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
/*IFX_MISRA_RULE_19_04_STATUS=First level of indirection is used to support
modification of OS protected calls, so it cannot be expand to a braced
initialiser*/
#define IOM_SFR_RUNTIME_SETENDINIT()           IOM_RUNTIME_SETENDINIT()
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
  /*IFX_MISRA_RULE_19_04_STATUS=First level of indirection is used to support
modification of OS protected calls, so it cannot be expand to a braced
 initialiser*/
#define IOM_SFR_RUNTIME_MODIFY32(reg,clearmask,setmask)   \
                             IOM_RUNTIME_MODIFY32((reg),(clearmask),(setmask))
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
/*IFX_MISRA_RULE_19_04_STATUS=First level of indirection is used to support
modification of OS protected calls, so it cannot be expand to a braced
initialiser*/
#define IOM_SFR_RUNTIME_RESETSAFETYENDINIT_TIMED(Time)  \
                              IOM_RUNTIME_RESETSAFETYENDINIT_TIMED(Time)
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
/*IFX_MISRA_RULE_19_04_STATUS=First level of indirection is used to support
modification of OS protected calls, so it cannot be expand to a braced
initialiser*/
#define IOM_SFR_RUNTIME_SETSAFETYENDINIT_TIMED()    \
                               IOM_RUNTIME_SETSAFETYENDINIT_TIMED()
#if (IOM_RUNNING_IN_USER_0_MODE_ENABLE == STD_ON)
  /*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
    /*IFX_MISRA_RULE_19_04_STATUS=First level of indirection is used to support
    modification of OS protected calls, so it cannot be expand to a braced
    initialiser*/
    #define IOM_SFR_RUNTIME_USER_MODE_WRITE32(reg, value) \
                           IOM_RUNTIME_USER_MODE_OS_API_WRITE32((reg),(value))
    /*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
    calls definition, it is declared as a function like macro*/
    /*IFX_MISRA_RULE_19_04_STATUS=First level of indirection is used to support
    modification of OS protected calls, so it cannot be expand to a braced
    initialiser*/
    #define IOM_SFR_RUNTIME_USER_MODE_READ32(reg)        \
                                        IOM_RUNTIME_USER_MODE_OS_API_READ32(reg)
    /*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
    calls definition, it is declared as a function like macro*/
    /*IFX_MISRA_RULE_19_04_STATUS=First level of indirection is used to support
     modification of OS protected calls, so it cannot be expand to a braced
    initialiser*/
    #define IOM_SFR_RUNTIME_USER_MODE_MODIFY32(reg,clearmask,setmask) \
              IOM_RUNTIME_USER_MODE_OS_API_MODIFY32((reg),(clearmask),(setmask))
#else
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
  /*IFX_MISRA_RULE_19_04_STATUS=First level of indirection is used to support
     modification of OS protected calls, so it cannot be expand to a braced
    initialiser*/
  #define IOM_SFR_RUNTIME_USER_MODE_WRITE32(reg,value)         ((reg) = (value))
  /*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
  #define IOM_SFR_RUNTIME_USER_MODE_READ32(reg)                 (reg)
    /*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
    /*IFX_MISRA_RULE_19_04_STATUS=First level of indirection is used to support
modification of OS protected calls, so it cannot be expand to a braced
 initialiser*/
  #define IOM_SFR_RUNTIME_USER_MODE_MODIFY32(reg,clearmask,setmask) \
      { uint32 val ; val = (reg) ; val &= (clearmask); val |= (setmask); \
                                                                   (reg) = val;}
#endif /* IOM_RUNNING_IN_USER_0_MODE_ENABLE == STD_ON  */
#else
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define IOM_SFR_RUNTIME_RESETENDINIT()           (Mcal_ResetENDINIT())
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
    /*IFX_MISRA_RULE_19_04_STATUS=First level of indirection is used to support
modification of OS protected calls, so it cannot be expand to a braced
 initialiser*/
#define IOM_SFR_RUNTIME_MODIFY32(reg, clearmask,setmask) \
  {uint32 val ; val = (reg) ; val &= (clearmask); val |= (setmask);(reg) = val;}
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define IOM_SFR_RUNTIME_SETENDINIT()              (Mcal_SetENDINIT())
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define IOM_SFR_RUNTIME_RESETSAFETYENDINIT_TIMED(Time)   \
                                           (Mcal_ResetSafetyENDINIT_Timed(Time))
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define IOM_SFR_RUNTIME_SETSAFETYENDINIT_TIMED() (Mcal_SetSafetyENDINIT_Timed())
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define IOM_SFR_RUNTIME_USER_MODE_WRITE32(reg, value)    ((reg) = (value))
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define IOM_SFR_RUNTIME_USER_MODE_READ32(reg)      (reg)
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
    /*IFX_MISRA_RULE_19_04_STATUS=First level of indirection is used to support
modification of OS protected calls, so it cannot be expand to a braced
 initialiser*/
#define IOM_SFR_RUNTIME_USER_MODE_MODIFY32(reg,clearmask,setmask)  \
   {uint32 val ; val = (reg); val &= (clearmask); val |= (setmask);(reg) = val;}
#endif /* IOM_USER_MODE_RUNTIME_API_ENABLE = STD_ON */

