smileAs/discovery_tc27x/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC27X_DC_PB_DEMOCD_V500_REL322/TC27x_DCstep/Aurix_MC-ISAR/iom_infineon_tricore/ssc/inc/Iom.h
#if (IOM_USER_MODE_DEINIT_API_ENABLE == STD_ON)
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
/*IFX_MISRA_RULE_19_04_STATUS=First level of indirection is used to support
modification of OS protected calls, so it cannot be expand to a braced
initialiser*/
#define IOM_SFR_DEINIT_RESETENDINIT()            IOM_DEINIT_RESETENDINIT()
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
/*IFX_MISRA_RULE_19_04_STATUS=First level of indirection is used to support
modification of OS protected calls, so it cannot be expand to a braced
initialiser*/
#define IOM_SFR_DEINIT_SETENDINIT()              IOM_DEINIT_SETENDINIT()
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
  /*IFX_MISRA_RULE_19_04_STATUS=First level of indirection is used to support
modification of OS protected calls, so it cannot be expand to a braced
 initialiser*/
#define IOM_SFR_DEINIT_WRITE32(reg,value)   IOM_DEINIT_WRITE32((reg),(value))
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
  /*IFX_MISRA_RULE_19_04_STATUS=First level of indirection is used to support
modification of OS protected calls, so it cannot be expand to a braced
 initialiser*/
#define IOM_SFR_DEINIT_MODIFY32(reg,clearmask,setmask)  \
                             IOM_DEINIT_MODIFY32((reg),(clearmask),(setmask))
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
/*IFX_MISRA_RULE_19_04_STATUS=First level of indirection is used to support
modification of OS protected calls, so it cannot be expand to a braced
 initialiser*/
#define IOM_SFR_DEINIT_RESETSAFETYENDINIT_TIMED(Time)    \
                              IOM_DEINIT_RESETSAFETYENDINIT_TIMED(Time)
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
/*IFX_MISRA_RULE_19_04_STATUS=First level of indirection is used to support
modification of OS protected calls, so it cannot be expand to a braced
 initialiser*/
#define IOM_SFR_DEINIT_SETSAFETYENDINIT_TIMED() \
                                            IOM_DEINIT_SETSAFETYENDINIT_TIMED()
#if (IOM_RUNNING_IN_USER_0_MODE_ENABLE == STD_ON)
  /*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
/*IFX_MISRA_RULE_19_04_STATUS=First level of indirection is used to support
modification of OS protected calls, so it cannot be expand to a braced
initialiser*/
    #define IOM_SFR_DEINIT_USER_MODE_WRITE32(reg, value)\
                          IOM_DEINIT_USER_MODE_OS_API_WRITE32((reg),(value))
   /*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
     calls definition, it is declared as a function like macro*/
     /*IFX_MISRA_RULE_19_04_STATUS=First level of indirection is used to support
        modification of OS protected calls, so it cannot be expand to a braced
        initialiser*/
    #define IOM_SFR_DEINIT_USER_MODE_READ32(reg)\
               IOM_DEINIT_USER_MODE_OS_API_READ32(reg)
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
/*IFX_MISRA_RULE_19_04_STATUS=First level of indirection is used to support
modification of OS protected calls, so it cannot be expand to a braced
 initialiser*/
      #define IOM_SFR_DEINIT_USER_MODE_MODIFY32(reg,clearmask,setmask) \
          IOM_DEINIT_USER_MODE_OS_API_MODIFY32((reg),(clearmask),(setmask))
#else
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
  /*IFX_MISRA_RULE_19_04_STATUS=First level of indirection is used to support
modification of OS protected calls, so it cannot be expand to a braced
 initialiser*/
  #define IOM_SFR_DEINIT_USER_MODE_WRITE32(reg,value)    ((reg) = (value))
   /*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
    #define IOM_SFR_DEINIT_USER_MODE_READ32(reg)             (reg)
  /*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
    /*IFX_MISRA_RULE_19_04_STATUS=First level of indirection is used to support
modification of OS protected calls, so it cannot be expand to a braced
 initialiser*/
    #define IOM_SFR_DEINIT_USER_MODE_MODIFY32(reg,clearmask,setmask) \
      { uint32 val ; val = (reg) ; val &= (clearmask); val |= (setmask); \
                                                                (reg) = val;}
    #endif /* IOM_RUNNING_IN_USER_MODE_ENABLE == STD_ON  */
#else
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define IOM_SFR_DEINIT_RESETENDINIT()            (Mcal_ResetENDINIT())
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
   /*IFX_MISRA_RULE_19_04_STATUS=First level of indirection is used to support
modification of OS protected calls, so it cannot be expand to a braced
 initialiser*/
#define IOM_SFR_DEINIT_WRITE32(reg, value)       ((reg) = (value))
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
    /*IFX_MISRA_RULE_19_04_STATUS=First level of indirection is used to support
modification of OS protected calls, so it cannot be expand to a braced
 initialiser*/
#define IOM_SFR_DEINIT_MODIFY32(reg, clearmask,setmask) \
     { uint32 val ; val = (reg) ; val &= (clearmask); val |= (setmask); \
                                                               (reg) = val;}
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define IOM_SFR_DEINIT_SETENDINIT()               (Mcal_SetENDINIT())
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define IOM_SFR_DEINIT_RESETSAFETYENDINIT_TIMED(Time)   \
                          (Mcal_ResetSafetyENDINIT_Timed(Time))
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define IOM_SFR_DEINIT_SETSAFETYENDINIT_TIMED()  (Mcal_SetSafetyEndInit_Timed())
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define IOM_SFR_DEINIT_USER_MODE_WRITE32(reg, value)   ((reg) = (value))
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define IOM_SFR_DEINIT_USER_MODE_READ32(reg)            (reg)
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
    /*IFX_MISRA_RULE_19_04_STATUS=First level of indirection is used to support
modification of OS protected calls, so it cannot be expand to a braced
 initialiser*/
#define IOM_SFR_DEINIT_USER_MODE_MODIFY32(reg,clearmask,setmask)  \
     { uint32 val ; val = (reg) ; val &= (clearmask); val |= (setmask); \
                                                                (reg) = val;}
#endif  /* IOM_USER_MODE_DEINIT_API_ENABLE == STD_ON  */

 /* IOM Vendor ID */
#define IOM_VENDOR_ID                     (17U)

