smileAs/discovery_tc27x/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC27X_DC_PB_DEMOCD_V500_REL322/TC27x_DCstep/Aurix_MC-ISAR/iom_infineon_tricore/ssc/inc/Iom.h
/* IOM Module ID */
#define IOM_MODULE_ID                     (255U)

#define IOM_MODULE_GLOB (MODULE_IOM)

#define IOM_SAFETY_ENDINIT_TIMEOUT (150000U)

#define IOM_KRSTCLR_SETMASK_VALUE (0x00000001U)
#define IOM_KRSTCLR_CLRMASK_VALUE (0xFFFFFFFFU)
#define IOM_ACCEN0_CLRMASK_VALUE  (0xFFFFFFFFU)
#define IOM_ACCEN0_SET_VALUE      (0xFFFFFFFFU)
/* Development error codes */

#if (IOM_DEV_ERROR_DETECT == STD_ON)
/* Indicates module is initialized */
#define IOM_INITIALISED       ((uint8)0x01)
/* Indicates module is uninitialized */
#define IOM_UNINITIALIZED     ((uint8)0x00)
/* Inidicates module initialized before calling Iom_Init() */
#define IOM_E_INIT            ((uint8)0x01)
/*  Indicates module uninitialized */
#define IOM_E_UNINIT          ((uint8)0x02)
/* Inidicates invalid configuration pointer */
#define IOM_E_PARAM_CONFIG    ((uint8)0x03)
/* Inidicates invalid parameter */
#define IOM_E_PARAM_INVALID   ((uint8)0x04)


/* Service ID for Iom_Init */
#define IOM_SID_INIT                          ((uint8)0x01U)
#define IOM_SID_DEINIT                        ((uint8)0x02U)
#define IOM_SID_GETVERINFO                    ((uint8)0x03U)
#define IOM_SID_SETFPCCOMP                    ((uint8)0x04U)
#define IOM_SID_GETFPCCOMP                    ((uint8)0x05U)
#define IOM_SID_GETFPCEDGESTAT                ((uint8)0x06U)
#define IOM_SID_CLRFPCEDGESTAT                ((uint8)0x07U)
#define IOM_SID_SETLAMTHRES                   ((uint8)0x08U)
#define IOM_SID_GETLAMTHRES                   ((uint8)0x09U)
#define IOM_SID_GETLAMENTWINCOUNT             ((uint8)0x0AU)
#define IOM_SID_SETLAMCONFIG                  ((uint8)0x0BU)
#define IOM_SID_GETLAMCONFIG                  ((uint8)0x0CU)
#define IOM_SID_GETECMGLOBEVESEL              ((uint8)0x0DU)
#define IOM_SID_SETECMGLOBEVESEL              ((uint8)0x0EU)
#define IOM_SID_GETECMTHRES                   ((uint8)0x0FU)
#define IOM_SID_SETECMTHRES                   ((uint8)0x10U)
#define IOM_SID_GETACCENREG                   ((uint8)0x11U)
#define IOM_SID_SETACCENREG                   ((uint8)0x12U)
#define IOM_SID_RESET                         ((uint8)0x13U)
#define IOM_SID_CLRRESET                      ((uint8)0x14U)
#endif



/*******************************************************************************
** Traceability     : [cover parentID=]                                       **
**                                                                            **
** Syntax           : void Iom_GetVersionInfo                                 **
**                    (                                                       **
**                      Std_VersionInfoType *VersionInfoPtr                   **
**                    )                                                       **
** [/cover]                                                                   **
**                                                                            **
** Service ID       : 0x03                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : non - reentrant                                         **
**                                                                            **
** Parameters (in)  : none                                                    **
**                                                                            **
** Parameters (out) : VersionInfoPtr - Pointer to store the                   **
**                    version information of this module.                     **
**                                                                            **
** Return value     : none                                                    **
**                                                                            **
** Description      : This function:                                          **
**   - returns the version information of this module                         **
**     The version information include : Module ID, Vendor ID,                **
**     Vendor specific version numbers                                        **
**   - This function is available if the IOM_VERSION_INFO_API is set ON       **
**                                                                            **
*******************************************************************************/
/* Enable / Disable the use of the function */
#if ( ((IOM_VERSION_INFO_API == STD_ON) && (IOM_DEV_ERROR_DETECT == STD_ON)) )
/*IFX_MISRA_RULE_19_07_STATUS=GetVersionInfo is declared as a function
 like macro as per AUTOSAR*/
 /*IFX_MISRA_RULE_19_04_STATUS=GetVersionInfo cannot be expand to a braced
 initialiser*/
#define Iom_GetVersionInfo(VersionInfoPtr)                                    \
{                                                                              \
  /* Check for DET: IOM_E_PARAM_INVALID */                                    \
  if ((VersionInfoPtr) == NULL_PTR)                                            \
  {                                                                            \
    /* Report IOM_E_PARAM_INVALID DET if service called with                  \
       NULL_PTR                                                                \
    */                                                                         \
    Det_ReportError(                                                           \
      (uint16)IOM_MODULE_ID,                                                  \
      IOM_INSTANCE_ID,                                                        \
      IOM_SID_GETVERINFO,                                                    \
      IOM_E_PARAM_INVALID);                                                   \
  }                                                                            \
  else                                                                         \
  {                                                                            \
        /* Vendor ID information */                                            \
        ((Std_VersionInfoType*)(VersionInfoPtr))->vendorID = IOM_VENDOR_ID;   \
        /* Iom module ID information */                                       \
        ((Std_VersionInfoType*)(VersionInfoPtr))->moduleID = IOM_MODULE_ID;   \
        /* Iom module Software major version information */                   \
        ((Std_VersionInfoType*)(VersionInfoPtr))->sw_major_version =           \
                                           (uint8)IOM_SW_MAJOR_VERSION;       \
        /* Iom module Software minor version information */                   \
        ((Std_VersionInfoType*)(VersionInfoPtr))->sw_minor_version =           \
                                           (uint8)IOM_SW_MINOR_VERSION;       \
        /* Iom module Software patch version information */                   \
        ((Std_VersionInfoType*)(VersionInfoPtr))->sw_patch_version =           \
                                           (uint8)IOM_SW_PATCH_VERSION;       \
  }                                                                            \
}
#elif((IOM_VERSION_INFO_API == STD_ON) && (IOM_DEV_ERROR_DETECT == STD_OFF))
/*IFX_MISRA_RULE_19_07_STATUS=GetVersionInfo is declared as a function
 like macro as per AUTOSAR*/
  /*IFX_MISRA_RULE_19_04_STATUS=GetVersionInfo cannot be expand to a braced
 initialiser*/
#define Iom_GetVersionInfo(VersionInfoPtr)                                    \
{                                                                              \
  /* Vendor ID information */                                                  \
  ((Std_VersionInfoType*)(VersionInfoPtr))->vendorID = IOM_VENDOR_ID;         \
  /* Iom module ID information */                                             \
  ((Std_VersionInfoType*)(VersionInfoPtr))->moduleID = IOM_MODULE_ID;         \
  /* Iom module Software major version information */                         \
  ((Std_VersionInfoType*)(VersionInfoPtr))->sw_major_version =                 \
                                     (uint8)IOM_SW_MAJOR_VERSION;             \
  /* Iom module Software minor version information */                         \
  ((Std_VersionInfoType*)(VersionInfoPtr))->sw_minor_version =                 \
                                     (uint8)IOM_SW_MINOR_VERSION;             \
  /* Iom module Software patch version information */                         \
  ((Std_VersionInfoType*)(VersionInfoPtr))->sw_patch_version =                 \
                                     (uint8)IOM_SW_PATCH_VERSION;             \
}/* Iom_GetVersionInfo */
#else /*(IOM_VERSION_INFO_API==STD_OFF)&&(IOM_DEV_ERROR_DETECT==STD_OFF)*/
/*IFX_MISRA_RULE_19_07_STATUS=GetVersionInfo is declared as a function
 like macro as per AUTOSAR*/
#define Iom_GetVersionInfo(VersionInfoPtr)                                    \
(ERROR_Iom_GetVersionInfo_NOT_SELECTED)

