smileAs/discovery_tc27x/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC27X_DC_PB_DEMOCD_V500_REL322/TC27x_DCstep/Aurix_MC-ISAR/iom_infineon_tricore/ssc/inc/Iom.h
#endif /* (IOM_VERSION_INFO_API) */
/*lint +e961*/
/*******************************************************************************
**                      Global Type Definitions                               **
*******************************************************************************/


 /* Type definition for FPC module */
typedef struct Iom_FpcConfigType
{
  uint32 FpcCfg;  /* FPC control value and compare value */
  uint16 FpcNo;    /* FPC unit Id */
}Iom_FpcConfigType;

/* Type definition for LAM module */
typedef struct Iom_LamConfigType
{
  uint32 LamEntWinCount; /* LAM event window threshold */
  uint32 LamCfg;  /* LAM Configuration register value */
  uint16 LamNo;    /* LAM unit Id */
}Iom_LamConfigType;

/* Type definition for ECM module */
typedef struct Iom_EcmConfigType
{
  uint32 EcmCountConfig;  /* ECM counter configuration register value*/
  uint32 EcmGlobEntSel;  /* ECM golbal event selection register value*/
}Iom_EcmConfigType;

/* Type definition for IOM channel */
typedef struct Iom_ConfigType
{
  const Iom_FpcConfigType *FpcConfig;
  const Iom_LamConfigType *LamConfig;
  const Iom_EcmConfigType *EcmConfig;
  uint32 GtmConfig;
  uint32 ClkCntrl;
  #if(IOM_ACCEN_MODE != IOM_ACCEN_API)
  uint32 AccessEnReg0;
  #endif
  /* Number of FPC and LAM uints */
  uint16 MaxChannel;
}Iom_ConfigType;


/*******************************************************************************
**                      Global Constant Declarations                          **
*******************************************************************************/
/* Declaration of Iom Post Build Configuration */

#define IOM_START_SEC_POSTBUILDCFG
#include "MemMap.h"
extern const struct Iom_ConfigType Iom_ConfigRoot[IOM_CONFIG_COUNT];
#define IOM_STOP_SEC_POSTBUILDCFG
#include "MemMap.h"


/*******************************************************************************
**                      Global Variable Declarations                          **
*******************************************************************************/

/*******************************************************************************
**                      Global Function Declarations                          **
*******************************************************************************/


/*Memory Map of the  Code*/
#define IOM_START_SEC_CODE
/*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
 allowed only for MemMap.h*/
#include "MemMap.h"

/*******************************************************************************
** Syntax : void Iom_Init(const Iom_ConfigType *ConfigPtr)                    **
**                                                                            **
** Service ID:  0x01                                                          **
**                                                                            **
** Sync/Async:  Synchronous                                                   **
**                                                                            **
** Reentrancy:  Non reentrant                                                 **
**                                                                            **
** Parameters (in): ConfigPtr (Pointer to a selected configuration structure) **
**                                                                            **
** Parameters (out): None                                                     **
**                                                                            **
** Return value: None                                                         **
**                                                                            **
** Description : Driver Module Initialization function.                       **
**                                                                            **
*******************************************************************************/
extern void Iom_Init(const Iom_ConfigType *ConfigPtr);

/*******************************************************************************
** Syntax : void Iom_DeInit(void)                                             **
**                                                                            **
** Service ID:  0x02                                                          **
**                                                                            **
** Sync/Async:  Synchronous                                                   **
**                                                                            **
** Reentrancy:  Non reentrant                                                 **
**                                                                            **
** Parameters (in): None                                                      **
**                                                                            **
** Parameters (out): None                                                     **
**                                                                            **
** Return value: None                                                         **
**                                                                            **
** Description : Driver Module Deinitialization function.Service for          **
**               deinitializing all hardware timers power on reset state.     **
**                                                                            **
**                                                                            **
*******************************************************************************/
#if (IOM_DEINIT_API == STD_ON)
extern void Iom_DeInit(void);
#else
/*IFX_MISRA_RULE_19_04_STATUS=Iom_DeInit cannot be expand to a braced
 initialiser*/
/*IFX_MISRA_RULE_19_07_STATUS=Iom_DeInit is declared as a function
 like macro as per AUTOSAR*/
#define Iom_DeInit()  ERROR_Gpt_DeInit_NOT_SELECTED

#endif

/*******************************************************************************
** Syntax : void Iom_ClrFpcEdgeStatus(uint8 FpcNo,uint8 Edge)                 **
**                                                                            **
** Service ID:  0x07                                                          **
**                                                                            **
** Sync/Async:  Synchronous                                                   **
**                                                                            **
** Reentrancy:  Reentrant                                                     **
**                                                                            **
** Parameters (in): FpcNo: Numeric identifier of the GPT channel              **
**                  Edge: Indicates positive, negative or both edge           **
**                                                                            **
** Parameters (out): None                                                     **
**                                                                            **
** Return value: None                                                         **
**                                                                            **
** Description : Service to clear positive, negative or both edge glitches    **
**                                                                            **
*******************************************************************************/
extern void Iom_ClrFpcEdgeStatus(uint8 FpcNo,uint8 Edge);

