smileAs/discovery_tc27x/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC27X_DC_PB_DEMOCD_V500_REL322/TC27x_DCstep/Aurix_MC-ISAR/iom_infineon_tricore/ssc/inc/Iom.h
/*******************************************************************************
** Syntax : void Iom_ResetKernel(void)                                        **
**                                                                            **
** Service ID:  0x13                                                          **
**                                                                            **
** Sync/Async: Synchronous                                                    **
**                                                                            **
** Reentrancy:  Reentrant                                                     **
**                                                                            **
** Parameters (in): None                                                      **
**                                                                            **
** Parameters (out): None                                                     **
**                                                                            **
** Return value: None                                                         **
**                                                                            **
** Description : This service to reset IOM kernel                             **
**                                                                            **
*******************************************************************************/
extern void Iom_ResetKernel(void);

/*******************************************************************************
**                      Global Inline Function Definitions                    **
*******************************************************************************/

/*******************************************************************************
** Syntax : _IFXEXTERN_ IFX_INLINE uint32 Iom_GetFpcEdgeStatus(void)          **
**                                                                            **
** Service ID:  0x06                                                          **
**                                                                            **
** Sync/Async:  Synchronous                                                   **
**                                                                            **
** Reentrancy:  Reentrant                                                     **
**                                                                            **
** Parameters (in): None                                                      **
**                                                                            **
** Parameters (out): None                                                     **
**                                                                            **
** Return value: uint32                                                       **
**                                                                            **
** Description : Service for reading the FPC Edge status of register          **
**                                                                            **
*******************************************************************************/
/*IFX_MISRA_RULE_08_05_STATUS=Allowed inline functions defined in header files*/
_IFXEXTERN_ IFX_INLINE uint32 Iom_GetFpcEdgeStatus(void)
{
  return((uint32)IOM_SFR_RUNTIME_USER_MODE_READ32(IOM_FPCESR.U));
}

/*******************************************************************************
** Syntax : _IFXEXTERN_ IFX_INLINE void Iom_ClrResetStatus(void)              **
**                                                                            **
** Service ID:  None                                                          **
**                                                                            **
** Sync/Async: Synchronous                                                    **
**                                                                            **
** Reentrancy:  Reentrant                                                     **
**                                                                            **
** Parameters (in): None                                                      **
**                                                                            **
** Parameters (out): None                                                     **
**                                                                            **
** Return value: None                                                         **
**                                                                            **
** Description : This service clear the kernel reset status bit               **
**                                                                            **
*******************************************************************************/
/*IFX_MISRA_RULE_08_05_STATUS=Allowed inline functions defined in header files*/
_IFXEXTERN_ IFX_INLINE void Iom_ClrResetStatus(void)
{
  /* Clear the ENDINIT bit in the WDT_CONSR register in order to disable
  the write-protection for
  registers protected via the EndInit feature */
  IOM_SFR_RUNTIME_RESETENDINIT();
  /*update IOM_KRSTCLR register*/
/*IFX_MISRA_RULE_08_05_STATUS=Allowed inline functions defined in header files*/
  IOM_SFR_RUNTIME_MODIFY32(IOM_MODULE_GLOB.KRSTCLR.U,\
        IOM_KRSTCLR_CLRMASK_VALUE,IOM_KRSTCLR_SETMASK_VALUE)
  /* set the ENDINIT bit in the WDT_CONSR register in order to enable
  the write-protection for
  registers protected via the EndInit feature */
  IOM_SFR_RUNTIME_SETENDINIT();
  return;
}
/*******************************************************************************
** Syntax : _IFXEXTERN_ IFX_INLINE void Iom_SetEcmThresVal(uint8 CounterNo,   **
**                                                       uint8 CountVal)      **
**                                                                            **
** Service ID:  0x10                                                          **
**                                                                            **
** Sync/Async: Synchronous                                                    **
**                                                                            **
** Reentrancy:  Reentrant                                                     **
**                                                                            **
** Parameters (in): CounterNo: Counter number                                 **
**                  Value: Threshold value for the counter                    **
**                                                                            **
** Parameters (out): None                                                     **
**                                                                            **
** Return value: None                                                         **
**                                                                            **
** Description :This service shall change the ECMs counter threshold value    **
**                                                                            **
*******************************************************************************/
/*IFX_MISRA_RULE_08_05_STATUS=Allowed inline functions defined in header files*/
_IFXEXTERN_ IFX_INLINE void Iom_SetEcmThresVal(uint8 CounterNo,
                                             uint8 CountVal,
                                             uint8 SelInput)
 {
/*IFX_MISRA_RULE_08_05_STATUS=Allowed inline functions defined in header files*/
  uint32 EcmThres;
/*IFX_MISRA_RULE_08_05_STATUS=Allowed inline functions defined in header files*/
  uint8 CountValue;
/*IFX_MISRA_RULE_08_05_STATUS=Allowed inline functions defined in header files*/
  uint8 CountId;
/*IFX_MISRA_RULE_08_05_STATUS=Allowed inline functions defined in header files*/
  uint8 Input;
  CountValue = CountVal & 0x0fU;
  CountId = CounterNo & 0x03U;
  Input = SelInput & 0x0fU;
  EcmThres = ((uint32)Input << (CountId * 8U)) |
              ((uint32)CountValue << (4U + (CountId * 8U)));
   /*update IOM_ECMCCFG register*/
  IOM_SFR_RUNTIME_USER_MODE_WRITE32(IOM_ECMCCFG.U,EcmThres);
  return;
}

