smileAs/discovery_tc27x/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC27X_DC_PB_DEMOCD_V500_REL322/TC27x_DCstep/Aurix_MC-ISAR/iom_infineon_tricore/ssc/inc/Iom.h
/*******************************************************************************
** Syntax : _IFXEXTERN_ IFX_INLINE uint8 Iom_GetEcmThresVal(uint8 CounterNo)  **
**                                                                            **
** Service ID:  0x0F                                                          **
**                                                                            **
** Sync/Async: Synchronous                                                    **
**                                                                            **
** Reentrancy:  Reentrant                                                     **
**                                                                            **
** Parameters (in): CounterNo : Counter number in ECM                         **
**                                                                            **
** Parameters (out): None                                                     **
**                                                                            **
** Return value: uint8                                                        **
**                                                                            **
** Description : This service shall return threshold value of the counter     **
**               in ECM                                                       **
**                                                                            **
*******************************************************************************/
/*IFX_MISRA_RULE_8_05_STATUS=Allowed inline functions defined in header files*/
_IFXEXTERN_ IFX_INLINE uint8 Iom_GetEcmThresVal(uint8 CounterNo)
{
/*IFX_MISRA_RULE_08_05_STATUS=Allowed inline functions defined in header files*/
  uint32 CountThres;
/*IFX_MISRA_RULE_08_05_STATUS=Allowed inline functions defined in header files*/
  uint32 ThresVal;
/*IFX_MISRA_RULE_08_05_STATUS=Allowed inline functions defined in header files*/
  uint8 CounterId;
  CounterId = CounterNo & 0x03U;
  CountThres = (uint32)0x0000000fU <<(4U + (CounterId * 8U));
  ThresVal = (CountThres & IOM_SFR_RUNTIME_USER_MODE_READ32(IOM_ECMCCFG.U))\
                    >> (4U + (CounterId * 8U));
  return((uint8)ThresVal);
}

/*******************************************************************************
** Syntax : _IFXEXTERN_ IFX_INLINE void Iom_SetFpcCompare(uint8 FpcNO,        **
**                                                      uint16  CompVal)      **
**                                                                            **
** Service ID:  0x04                                                          **
**                                                                            **
** Sync/Async:  Synchronous                                                   **
**                                                                            **
** Reentrancy:  Reentrant                                                     **
**                                                                            **
** Parameters (in): FpcNo: Fpc number                                         **
**                 CompVal: Compare value for the FPC                         **
**                                                                            **
** Parameters (out): None                                                     **
**                                                                            **
** Return value: void                                                         **
**                                                                            **
** Description : Service to set FPC compare value                             **
*******************************************************************************/
/*IFX_MISRA_RULE_08_05_STATUS=Allowed inline functions defined in header files*/
_IFXEXTERN_ IFX_INLINE void Iom_SetFpcCompare(uint8 FpcNo,uint16 CompVal)
{
/*IFX_MISRA_RULE_08_05_STATUS=Allowed inline functions defined in header files*/
  uint8 FpcId;
  FpcId = FpcNo & 0x0fU;
  /*update IOM_FPCCTR register*/
/*IFX_MISRA_RULE_08_05_STATUS=Allowed inline functions defined in header files*/
  IOM_SFR_RUNTIME_USER_MODE_MODIFY32\
             (IOM_MODULE_GLOB.FPCCTR[FpcId].U, IOM_FPCCTR_CMP,(uint32)CompVal)
  return;
}

/*******************************************************************************
** Syntax : _IFXEXTERN_ IFX_INLINE uint16 Iom_GetFpcCompare(uint8 FpcNO)      **
**                                                                            **
** Service ID:  0x05                                                          **
**                                                                            **
** Sync/Async:  Synchronous                                                   **
**                                                                            **
** Reentrancy:  Reentrant                                                     **
**                                                                            **
** Parameters (in): FpcNo: Fpc number                                         **
**                                                                            **
** Parameters (out): None                                                     **
**                                                                            **
** Return value: uint32                                                       **
**                                                                            **
** Description : Service shall be  provided to get the FPC compare value      **
*******************************************************************************/
/*IFX_MISRA_RULE_08_05_STATUS=Allowed inline functions defined in header files*/
_IFXEXTERN_ IFX_INLINE uint16 Iom_GetFpcCompare(uint8 FpcNo)
{
/*IFX_MISRA_RULE_08_05_STATUS=Allowed inline functions defined in header files*/
  uint8 FpcId;
  FpcId = FpcNo & 0x0fU;
   return ((uint16)((IOM_SFR_INIT_USER_MODE_READ32\
                  (IOM_MODULE_GLOB.FPCCTR[FpcId].U)) & IOM_FPCCTR_CMP_SETMASK));
}

