smileAs/discovery_tc27x/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC27X_DC_PB_DEMOCD_V500_REL322/TC27x_DCstep/Aurix_MC-ISAR/iom_infineon_tricore/ssc/inc/Iom.h
/*******************************************************************************
** Syntax : _IFXEXTERN_ IFX_INLINE void Iom_SetLamThreshold(uint8 LamNo,      **
**                                                        uint32 Value)       **
**                                                                            **
** Service ID:  0x08                                                          **
**                                                                            **
** Sync/Async:  Synchronous                                                   **
**                                                                            **
** Reentrancy:  Reentrant                                                     **
**                                                                            **
** Parameters (in): LamNo: LAM unit number                                    **
**                  Value: Threshold value
**                                                                            **
** Parameters (out): None                                                     **
**                                                                            **
** Return value: None                                                         **
**                                                                            **
** Description : Service for changing LAM threshold value                     **
**                                                                            **
**                                                                            **
*******************************************************************************/
/*IFX_MISRA_RULE_08_05_STATUS=Allowed inline functions defined in header files*/
_IFXEXTERN_ IFX_INLINE void Iom_SetLamThreshold(uint8 LamNo,uint32 ThresVal)
{
/*IFX_MISRA_RULE_08_05_STATUS=Allowed inline functions defined in header files*/
  uint32 LamThres;
/*IFX_MISRA_RULE_08_05_STATUS=Allowed inline functions defined in header files*/
  uint8 LamId;
  LamId = LamNo & 0x0fU;
  LamThres = ThresVal & 0x00ffffffU;
  /*update IOM_LAMEWS register*/
 IOM_SFR_RUNTIME_USER_MODE_WRITE32(IOM_MODULE_GLOB.LAMEWS[LamId].U,LamThres);
}

/*******************************************************************************
** Syntax : _IFXEXTERN_ IFX_INLINE uint32 Iom_GetLamThreshold(uint8 LamNo)    **
**                                                                            **
** Service ID:  0x09                                                          **
**                                                                            **
** Sync/Async: Synchronous                                                    **
**                                                                            **
** Reentrancy:  Reentrant                                                     **
**                                                                            **
** Parameters (in):   LamNO: Lam number                                       **
**                                                                            **
** Parameters (out): None                                                     **
**                                                                            **
** Return value: LAM unit threshold value                                     **
**                                                                            **
** Description : Service shall return Lam threshold value                     **
**                                                                            **
*******************************************************************************/
/*IFX_MISRA_RULE_08_05_STATUS=Allowed inline functions defined in header files*/
_IFXEXTERN_ IFX_INLINE uint32 Iom_GetLamThreshold(uint8 LamNo)
{
/*IFX_MISRA_RULE_08_05_STATUS=Allowed inline functions defined in header files*/
  uint32 ThresVal;
/*IFX_MISRA_RULE_08_05_STATUS=Allowed inline functions defined in header files*/
  uint8 LamId;
  LamId = LamNo & 0x0fU;
  ThresVal = (uint32)IOM_SFR_RUNTIME_USER_MODE_READ32\
                            (IOM_MODULE_GLOB.LAMEWS[LamId].U) & 0x00ffffffU;
  return(ThresVal);
}

/*******************************************************************************
** Syntax : _IFXEXTERN_ IFX_INLINE uint32 Iom_GetLamEntWinCount(uint8 LamNo)  **
**                                                                            **
** Service ID:  0x0A                                                          **
**                                                                            **
** Sync/Async: Synchronous                                                    **
**                                                                            **
** Reentrancy:  Non Reentrant                                                 **
**                                                                            **
** Parameters (in): LamNo: Lam number                                         **
**                                                                            **
** Parameters (out): None                                                     **
**                                                                            **
** Return value: uint32                                                       **
**                                                                            **
** Description : Service for reading event window count value                 **
**                                                                            **
*******************************************************************************/
/*IFX_MISRA_RULE_08_05_STATUS=Allowed inline functions defined in header files*/
_IFXEXTERN_ IFX_INLINE uint32 Iom_GetLamEntWinCount(uint8 LamNo)
{
/*IFX_MISRA_RULE_08_05_STATUS=Allowed inline functions defined in header files*/
  uint8 LamId;
  LamId = LamNo & 0x0fU;
  return((uint32)IOM_SFR_RUNTIME_USER_MODE_READ32\
                (IOM_MODULE_GLOB.LAMEWC[LamId].U));

