smileAs/discovery_tc27x/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC27X_DC_PB_DEMOCD_V500_REL322/TC27x_DCstep/Aurix_MC-ISAR/iom_infineon_tricore/ssc/inc/Iom.h
}

/*******************************************************************************
** Syntax : _IFXEXTERN_ IFX_INLINE void Iom_SetLamConfig(uint8 LamNo,         **
**                                                     uint32 ConfigVal)      **
**                                                                            **
** Service ID:  0x0B                                                          **
**                                                                            **
** Sync/Async: Synchronous                                                    **
**                                                                            **
** Reentrancy:  Reentrant                                                     **
**                                                                            **
** Parameters (in): LamNo: LAM unit number                                    **
**                  ConfigVal:LAM configuration value                         **
**                                                                            **
** Parameters (out): None                                                     **
**                                                                            **
** Return value: None                                                         **
**                                                                            **
** Description : This service is provided to change LAM configuration         **
**                                                                            **
*******************************************************************************/
/*IFX_MISRA_RULE_08_05_STATUS=Allowed inline functions defined in header files*/
_IFXEXTERN_ IFX_INLINE void Iom_SetLamConfig(uint8 LamNo, uint32 ConfigVal)
{
/*IFX_MISRA_RULE_08_05_STATUS=Allowed inline functions defined in header files*/
  uint8 LamId;
  LamId = LamNo & 0x0fU;
  /*update IOM_LAMCFG register*/
  IOM_SFR_RUNTIME_USER_MODE_WRITE32(IOM_MODULE_GLOB.LAMCFG[LamId].U,\
                                                                     ConfigVal);
}

/******************************************************************************
** Syntax : _IFXEXTERN_ IFX_INLINE uint32 Iom_GetLamConfig(uint8 LamNo)       **
**                                                                            **
** Service ID:  0x0C                                                          **
**                                                                            **
** Sync/Async: Synchronous                                                    **
**                                                                            **
** Reentrancy:  Reentrant                                                     **
**                                                                            **
** Parameters (in): LamNo: Lam number                                         **
**                                                                            **
** Parameters (out): None                                                     **
**                                                                            **
** Return value: uint32                                                       **
**                                                                            **
** Description : This service shall return Lam configuration value            **
**                                                                            **
*******************************************************************************/
/*IFX_MISRA_RULE_08_05_STATUS=Allowed inline functions defined in header files*/
_IFXEXTERN_ IFX_INLINE uint32 Iom_GetLamConfig(uint8 LamNo)
{
/*IFX_MISRA_RULE_08_05_STATUS=Allowed inline functions defined in header files*/
  uint8 LamId;
  LamId = LamNo & 0x0fU;
  return((uint32)IOM_SFR_RUNTIME_USER_MODE_READ32\
                                    (IOM_MODULE_GLOB.LAMCFG[LamId].U));

}

/*******************************************************************************
** Syntax : _IFXEXTERN_ IFX_INLINE uint32 Iom_GetEcmGlobalEveSel(void)        **
**                                                                            **
** Service ID:  0x0D                                                          **
**                                                                            **
** Sync/Async: Synchronous                                                    **
**                                                                            **
** Reentrancy:  Reentrant                                                     **
**                                                                            **
** Parameters (in): None                                                      **
**                                                                            **
** Parameters (out): None                                                     **
**                                                                            **
** Return value: uint32                                                       **
**                                                                            **
** Description : This service shall return Global event selection register    **
**                                                                            **
*******************************************************************************/
/*IFX_MISRA_RULE_08_05_STATUS=Allowed inline functions defined in header files*/
_IFXEXTERN_ IFX_INLINE uint32 Iom_GetEcmGlobalEveSel(void)
{
  return((uint32)IOM_SFR_RUNTIME_USER_MODE_READ32(IOM_ECMSELR.U));
}

/*******************************************************************************
** Syntax : _IFXEXTERN_ IFX_INLINE void Iom_SetEcmGlobalEveSel(uint32 Value)  **
**                                                                            **
** Service ID:  0x0E                                                          **
**                                                                            **
** Sync/Async: Synchronous                                                    **
**                                                                            **
** Reentrancy:  Reentrant                                                     **
**                                                                            **
** Parameters (in): Value: To select channel/counter output                   **
**                                                                            **
** Parameters (out): None                                                     **
**                                                                            **
** Return value: None                                                         **
**                                                                            **
** Description : This service shall set Global event selection register       **
**                                                                            **
*******************************************************************************/
/*IFX_MISRA_RULE_08_05_STATUS=Allowed inline functions defined in header files*/
_IFXEXTERN_ IFX_INLINE void Iom_SetEcmGlobalEveSel(uint32 Value)
{
/*IFX_MISRA_RULE_08_05_STATUS=Allowed inline functions defined in header files*/
  uint32 EcmVal;
  EcmVal = Value & 0x000fffffU;
  /*update IOM_ECMSELR register*/
  IOM_SFR_RUNTIME_USER_MODE_WRITE32(IOM_ECMSELR.U,EcmVal);
}

