smileAs/discovery_tc27x/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC27X_DC_PB_DEMOCD_V500_REL322/TC27x_DCstep/Aurix_MC-ISAR/iom_infineon_tricore/ssc/inc/Iom.h
#if (IOM_ACCEN_MODE == IOM_ACCEN_API)
/*******************************************************************************
** Syntax : _IFXEXTERN_ IFX_INLINE uint32 Iom_GetAccessEnReg0(void)           **
**                                                                            **
** Service ID:  0x11                                                          **
**                                                                            **
** Sync/Async: Synchronous                                                    **
**                                                                            **
** Reentrancy:  Reentrant                                                     **
**                                                                            **
** Parameters (in): None                                                      **
**                                                                            **
** Parameters (out): None                                                     **
**                                                                            **
** Return value: Access enable register 0 value                               **
**                                                                            **
** Description : This service shall read access enable register 0 value       **
**                                                                            **
*******************************************************************************/
/*IFX_MISRA_RULE_08_05_STATUS=Allowed inline functions defined in header files*/
_IFXEXTERN_ IFX_INLINE uint32 Iom_GetAccessEnReg0(void)
{
  return((uint32)IOM_SFR_RUNTIME_USER_MODE_READ32(IOM_ACCEN0.U));
}

/*******************************************************************************
** Syntax : _IFXEXTERN_ IFX_INLINE void Iom_SetAccessEnReg0(uint32 Value)     **
**                                                                            **
** Service ID:  0x12                                                          **
**                                                                            **
** Sync/Async: Synchronous                                                    **
**                                                                            **
** Reentrancy:  Reentrant                                                     **
**                                                                            **
** Parameters (in): Value: to set access enable register 0                    **
**                                                                            **
** Parameters (out): None                                                     **
**                                                                            **
** Return value: None                                                         **
**                                                                            **
** Description : This service shall set access enable register 0 to controls  **
**            write access to IOM kernel addresses for transactions with      **
**               with master tag id n                                         **
**                                                                            **
*******************************************************************************/
/*IFX_MISRA_RULE_08_05_STATUS=Allowed inline functions defined in header files*/
_IFXEXTERN_ IFX_INLINE void Iom_SetAccessEnReg0(uint32 Value)
{
/*IFX_MISRA_RULE_08_05_STATUS=Allowed inline functions defined in header files*/
  uint32 IOM_ACCEN0_SETMASK_VALUE = Value;
    /* Clear the SafetyENDINIT bit in the WDT_CON0 register in order
    to disable the write-protection for registers protected
    via the EndInit feature */
    IOM_SFR_RUNTIME_RESETSAFETYENDINIT(SENT_SAFETY_ENDINIT_TIMEOUT);
        IOM_SFR_RUNTIME_MODIFY32(*((uint32 *)((void *)&IOM_ACCEN0)),\
                          (~IOM_ACCEN0_CLRMASK_VALUE),IOM_ACCEN0_SETMASK_VALUE);
    /* set the SafetyENDINIT bit in the WDT_CON0 register in order
    to enable the write-protection for registers protected
    via the EndInit feature */
    IOM_SFR_RUNTIME_SETSAFETYENDINIT();
}
#endif

#define IOM_STOP_SEC_CODE
/*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
 allowed only for MemMap.h*/
#include "MemMap.h"




#endif /* IOM_H */
